{
  "0": 23,
  "1": 11,
  "2": 13,
  "3": 49,
  "4": 61,
  "5": 140,
  "6": 143,
  "7": 188,
  "8": 167,
  "9": 197,
  "<pad>": 0,
  "<unk>": 1,
  "<sos>": 2,
  "<eos>": 3,
  "<mask>": 4,
  "{": 5,
  "}": 6,
  "_": 7,
  "^": 8,
  ")": 9,
  "(": 10,
  ",": 12,
  "-": 14,
  "=": 15,
  "\\\\": 16,
  "+": 17,
  "\\begin{aligned}": 18,
  "\\end{aligned}": 19,
  "x": 20,
  "n": 21,
  "i": 22,
  "\\frac": 24,
  "t": 25,
  "k": 26,
  "&": 27,
  ".": 28,
  "d": 29,
  "j": 30,
  "|": 31,
  "a": 32,
  "s": 33,
  "m": 34,
  "p": 35,
  "u": 36,
  "r": 37,
  "f": 38,
  "e": 39,
  "l": 40,
  "\\,": 41,
  "y": 42,
  "g": 43,
  "c": 44,
  "z": 45,
  "\\left(": 46,
  "\\right)": 47,
  "\\alpha": 48,
  "q": 50,
  "\\sum": 51,
  "\\prime": 52,
  "b": 53,
  "v": 54,
  "A": 55,
  "\\lambda": 56,
  "h": 57,
  "\\mu": 58,
  "N": 59,
  "T": 60,
  "X": 62,
  "]": 63,
  "\\partial": 64,
  "\\int": 65,
  "[": 66,
  "\\operatorname": 67,
  "R": 68,
  "L": 69,
  "\\in": 70,
  "~": 71,
  "\\mathrm": 72,
  "B": 73,
  "\\beta": 74,
  "o": 75,
  "/": 76,
  "S": 77,
  "F": 78,
  "P": 79,
  "w": 80,
  "C": 81,
  "\\|": 82,
  "M": 83,
  "H": 84,
  "\\infty": 85,
  "D": 86,
  "\\pi": 87,
  "\\mathcal": 88,
  "\\gamma": 89,
  ":": 90,
  "*": 91,
  "\\phi": 92,
  "E": 93,
  "\\theta": 94,
  "\\sigma": 95,
  "\\delta": 96,
  "\\xi": 97,
  "\\tau": 98,
  "I": 99,
  "\\nu": 100,
  "\\operatorname*": 101,
  "\\rho": 102,
  "\\leq": 103,
  "\\": 104,
  "\\;": 105,
  "G": 106,
  "\\cdot": 107,
  "V": 108,
  "K": 109,
  "\\tilde": 110,
  "\\omega": 111,
  "\\}": 112,
  "\\eta": 113,
  "\\{": 114,
  "\\psi": 115,
  "\\bar": 116,
  "\\mathbb": 117,
  "Q": 118,
  "\\sqrt": 119,
  "\\varphi": 120,
  "\\ell": 121,
  "U": 122,
  "\\big": 123,
  ";": 124,
  "\\nabla": 125,
  "Y": 126,
  "\\mathbf": 127,
  "\\hat": 128,
  "J": 129,
  "W": 130,
  "\\Delta": 131,
  "Z": 132,
  "\\ ": 133,
  "\\epsilon": 134,
  "\\Omega": 135,
  "<": 136,
  "\\Big": 137,
  "\\left\\{": 138,
  "\\Gamma": 139,
  "\\varepsilon": 141,
  "\\overline": 142,
  "\\rangle": 144,
  "\\left[": 145,
  "\\right]": 146,
  "\\Phi": 147,
  "\\cdots": 148,
  "\\langle": 149,
  "\\chi": 150,
  "\\ldots": 151,
  ">": 152,
  "\\zeta": 153,
  "\\otimes": 154,
  "\\geq": 155,
  "\\le": 156,
  "\\kappa": 157,
  "\\Lambda": 158,
  "\\cal": 159,
  "\\begin{array}": 160,
  "\\end{array}": 161,
  "\\right.": 162,
  "O": 163,
  "\\to": 164,
  "\\prod": 165,
  "\\bf": 166,
  "\\dots": 168,
  "\\widetilde": 169,
  "\\times": 170,
  "\\circ": 171,
  "\\quad": 172,
  "\\Psi": 173,
  "\\pm": 174,
  "\\dot": 175,
  "!": 176,
  "\\!": 177,
  "$": 178,
  "\\vec": 179,
  "\\binom": 180,
  "\\mathfrak": 181,
  "\\begin{matrix}": 182,
  "\\end{matrix}": 183,
  "\\widehat": 184,
  "\\rightarrow": 185,
  "\\right\\}": 186,
  "\\ast": 187,
  "\\wedge": 189,
  "\\cap": 190,
  "\\bigg": 191,
  "\\begin{cases}": 192,
  "\\end{cases}": 193,
  "\\Sigma": 194,
  "\\vert": 195,
  "\\right|": 196,
  "\\ge": 198,
  "\\forall": 199,
  "\\left|": 200,
  "\\boldsymbol": 201,
  "\\qquad": 202,
  "\\equiv": 203,
  "\\mid": 204,
  "\\Pi": 205,
  "\\Theta": 206,
  "\\Vert": 207,
  "\\neq": 208,
  "\\bigl": 209,
  "\\bigr": 210,
  "\\:": 211,
  "\\displaystyle": 212,
  "\\underline": 213,
  "\\textrm": 214,
  "\\dagger": 215,
  "\\cup": 216,
  "\\star": 217,
  "\\oplus": 218,
  "\\setminus": 219,
  "\\textbf": 220,
  "\\perp": 221,
  "\\Bigr": 222,
  "\\sim": 223,
  "\\iota": 224,
  "\\vartheta": 225,
  "\\Bigl": 226,
  "\\hbar": 227,
  "\\subset": 228,
  "\\mathsf": 229,
  "\\vdots": 230,
  "\\vee": 231,
  "\\bigcup": 232,
  "\\#": 233,
  "\\right\\rangle": 234,
  "\\varrho": 235,
  "\\right\\|": 236,
  "\\left\\|": 237,
  "\\left\\langle": 238,
  "\\biggr": 239,
  "\\left.": 240,
  "\\top": 241,
  "\\biggl": 242,
  "\\stackrel": 243,
  "\\d": 244,
  "'": 245,
  "\\hspace": 246,
  "\\rfloor": 247,
  "\\lfloor": 248,
  "\\lesssim": 249,
  "\\underset": 250,
  "\\Bigg": 251,
  "\\mapsto": 252,
  "\\bullet": 253,
  "\\Xi": 254,
  "\\P": 255,
  "\\check": 256,
  "\\approx": 257,
  "\\subseteq": 258,
  "\\not": 259,
  "\\right\\vert": 260,
  "\\bigoplus": 261,
  "\\leqslant": 262,
  "\\overset": 263,
  "\\left\\vert": 264,
  "\\Re": 265,
  "\\ddots": 266,
  "\\longrightarrow": 267,
  "\\backslash": 268,
  "\\mp": 269,
  "\\colon": 270,
  "\\emptyset": 271,
  "\\sharp": 272,
  "\\ne": 273,
  "\\textstyle": 274,
  "\\underbrace": 275,
  "\\varpi": 276,
  "\\lvert": 277,
  "\\rvert": 278,
  "\\textup": 279,
  "\\ddot": 280,
  "\\sf": 281,
  "\\dag": 282,
  "\\triangle": 283,
  "\\l": 284,
  "\\simeq": 285,
  "\\ll": 286,
  "\\bigcap": 287,
  "\\Upsilon": 288,
  "\\textnormal": 289,
  "\\upsilon": 290,
  "\\Im": 291,
  "\\left\\Vert": 292,
  "\\pmod": 293,
  "\\right\\Vert": 294,
  "\\Rightarrow": 295,
  "\\cong": 296,
  "\\right>": 297,
  "\\exists": 298,
  "\\imath": 299,
  "\\downarrow": 300,
  "\\bot": 301,
  "\\iint": 302,
  "\\left<": 303,
  "\\oint": 304,
  "\\notin": 305,
  "\\atop": 306,
  "\\left\\lbrace": 307,
  "\\L": 308,
  "\\pmb": 309,
  "\\left\\lfloor": 310,
  "\\right\\rfloor": 311,
  "\\lVert": 312,
  "\\geqslant": 313,
  "\\rbrace": 314,
  "\\lbrace": 315,
  "\\O": 316,
  "\\rceil": 317,
  "\\breve": 318,
  "\\lceil": 319,
  "\\rVert": 320,
  "\\uparrow": 321,
  "\\eqref": 322,
  "\\Leftrightarrow": 323,
  "\\boldmath": 324,
  "\\coloneqq": 325,
  "\\parallel": 326,
  "\\odot": 327,
  "\\i": 328,
  "\\flat": 329,
  "\\wp": 330,
  "\\mathtt": 331,
  "\\overrightarrow": 332,
  "\\phantom": 333,
  "\\Box": 334,
  "\\lbrack": 335,
  "\\dotsc": 336,
  "\\mod": 337,
  "\\varsigma": 338,
  "\\right\\rbrace": 339,
  "\\xrightarrow": 340,
  "--": 341,
  "\\sqcup": 342,
  "\\diamond": 343,
  "\\mathring": 344,
  "\\o": 345,
  "\\hdots": 346,
  "\\ref": 347,
  "\\boxtimes": 348,
  "\\Biggr": 349,
  "\\Biggl": 350,
  "\\textit": 351,
  "\\jmath": 352,
  "\\bmod": 353,
  "\\S": 354,
  "\\triangleq": 355,
  "\\varkappa": 356,
  "\\b": 357,
  "\\gg": 358,
  "\\div": 359,
  "\\scriptscriptstyle": 360,
  "\\propto": 361,
  "\\square": 362,
  "\\thinspace": 363,
  "\\leftrightarrow": 364,
  "\\hline": 365,
  "\\sp": 366,
  "\\prec": 367,
  "\\Longleftrightarrow": 368,
  "\\Longrightarrow": 369,
  "\\texttt": 370,
  "\\iff": 371,
  "\\tiny": 372,
  "\\mathop": 373,
  "\\supset": 374,
  "\\it": 375,
  "\\mathit": 376,
  "\\enspace": 377,
  "\\ni": 378,
  "\\cfrac": 379,
  "\\Tilde": 380,
  "\\implies": 381,
  "\\right\\rceil": 382,
  "\\bigwedge": 383,
  "\\left\\lceil": 384,
  "\\brack": 385,
  "\\emph": 386,
  "\\bigsqcup": 387,
  "\\acute": 388,
  "\\kern": 389,
  "\\intertext": 390,
  "\\scriptstyle": 391,
  "\\bigvee": 392,
  "\\bigotimes": 393,
  "\\rtimes": 394,
  "\\textsf": 395,
  "\\longmapsto": 396,
  "\\small": 397,
  "\\land": 398,
  "\\rhd": 399,
  "\\scriptsize": 400,
  "\\triangleright": 401,
  "\\preceq": 402,
  "\\middle": 403,
  "\\dotsb": 404,
  "\\mkern": 405,
  "\\boxplus": 406,
  "\\ss": 407,
  "\\intercal": 408,
  "\\ominus": 409,
  "\\natural": 410,
  "\\varnothing": 411,
  "\\searrow": 412,
  "\\nmid": 413,
  "\\vdash": 414,
  "\\dotsm": 415,
  "\\varGamma": 416,
  "\\substack": 417,
  "\\doteq": 418,
  "\\supseteq": 419,
  "\\slash": 420,
  "\\tt": 421,
  "\\asymp": 422,
  "\\hookrightarrow": 423,
  "?": 424,
  "\\leftarrow": 425,
  "\\textsc": 426,
  "\\enskip": 427,
  "\\rbrack": 428,
  "\\overbrace": 429,
  "\\genfrac": 430,
  "\\prescript": 431,
  "\\medskip": 432,
  "\\vphantom": 433,
  "\\angle": 434,
  "\\succeq": 435,
  "\\varprojlim": 436,
  "\\rightharpoonup": 437,
  "\\mathversion": 438,
  "\\bigtriangleup": 439,
  "\\&": 440,
  "\\gtrsim": 441,
  "\\varPhi": 442,
  "\\coprod": 443,
  "\\aligned": 444,
  "\\endaligned": 445,
  "\\underbar": 446,
  "\\begin{tabular}": 447,
  "\\end{tabular}": 448,
  "\\aleph": 449,
  "\\_": 450,
  "`": 451,
  "\\lrcorner": 452,
  "\\footnotesize": 453,
  "\\smallsetminus": 454,
  "\\right\\rvert": 455,
  "\\ltimes": 456,
  "\\real": 457,
  "\\nearrow": 458,
  "\\large": 459,
  "\\varinjlim": 460,
  "\\Bar": 461,
  "\\smile": 462,
  "\\intop": 463,
  "\\lor": 464,
  "\\left\\lvert": 465,
  "\\pounds": 466,
  "\\hphantom": 467,
  "\\triangleleft": 468,
  "\\Bbbk": 469,
  "\\longleftrightarrow": 470,
  "\\sb": 471,
  "\\succ": 472,
  "\\lhd": 473,
  "\\*": 474,
  "\\neg": 475,
  "\\mspace": 476,
  "\\AA": 477,
  "\\subsetneq": 478,
  "\\hslash": 479,
  "\\mathellipsis": 480,
  "\\varPsi": 481,
  "\\overleftarrow": 482,
  "\\xleftarrow": 483,
  "\\circledast": 484,
  "\\j": 485,
  "\\noalign": 486,
  "\\smallskip": 487,
  "\\/": 488,
  "\\leqq": 489,
  "\\allowbreak": 490,
  "\\sideset": 491,
  "\\eth": 492,
  "\\upharpoonright": 493,
  "\\mit": 494,
  "\\-": 495,
  "\"": 496,
  "\\boxed": 497,
  "\\models": 498,
  "\\c": 499,
  "\\vline": 500,
  "\\cdotp": 501,
  "\\buildrel": 502,
  "\\brace": 503,
  "\\varOmega": 504,
  "\\arraycolsep": 505,
  "\\Large": 506,
  "\\bigm": 507,
  "\\tag": 508,
  "\\restriction": 509,
  "\\frown": 510,
  "\\triangledown": 511,
  "\\arrowvert": 512,
  "\\vspace": 513,
  "\\shortintertext": 514,
  "\\Hat": 515,
  "\\smash": 516,
  "\\mathrel": 517,
  "\\varDelta": 518,
  "\\rlap": 519,
  "\\normalsize": 520,
  "\\vartriangle": 521,
  "\\SS": 522,
  "\\upshape": 523,
  "\\makebox": 524,
  "\\setlength": 525,
  "\\bigtriangledown": 526,
  "\\mathbin": 527,
  "\\wr": 528,
  "\\varLambda": 529,
  "\\ae": 530,
  "\\strut": 531,
  "\\protect": 532,
  "\\raise": 533,
  "\\null": 534,
  "\\ddagger": 535,
  "\\uppercase": 536,
  "\\expandafter": 537,
  "\\romannumeral": 538,
  "\\textmd": 539,
  "\\circlearrowleft": 540,
  "\\left\\lVert": 541,
  "\\right\\rVert": 542,
  "\\sl": 543,
  "\\lefteqn": 544,
  "\\iiint": 545,
  "\\raisebox": 546,
  "\\dddot": 547,
  "\\diamondsuit": 548,
  "\\ensuremath": 549,
  "\\em": 550,
  "\\supsetneq": 551,
  "\\textsuperscript": 552,
  "\\Diamond": 553,
  "\\sqcap": 554,
  "\\left/": 555,
  "\\geqq": 556,
  "\\rightsquigarrow": 557,
  "\\trianglelefteq": 558,
  "\\cite": 559,
  "\\uplus": 560,
  "\\cline": 561,
  "\\smallint": 562,
  "\\complement": 563,
  "\\biggm": 564,
  "\\sqsubset": 565,
  "\\itshape": 566,
  "\\varlimsup": 567,
  "\\centerdot": 568,
  "\\rightrightarrows": 569,
  "\\twoheadrightarrow": 570,
  "\\fbox": 571,
  "\\rq": 572,
  "\\mathord": 573,
  "\\biguplus": 574,
  "\\allowdisplaybreaks": 575,
  "\\updownarrow": 576,
  "\\llcorner": 577,
  "\\textsl": 578,
  "\\digamma": 579,
  "\\longleftarrow": 580,
  "\\bmatrix": 581,
  "\\endbmatrix": 582,
  "\\vcentcolon": 583,
  "\\sc": 584,
  "\\ldotp": 585,
  "\\ggg": 586,
  "---": 587,
  "\\oslash": 588,
  "\\smallfrown": 589,
  "\\MoveEqLeft": 590,
  "\\leadsto": 591,
  "\\bigstar": 592,
  "@": 593,
  "\\amalg": 594,
  "\\grave": 595,
  "\\bigskip": 596,
  "\\shortparallel": 597,
  "\\(": 598,
  "\\)": 599,
  "\\llap": 600,
  "\\lnot": 601,
  "\\multicolumn": 602,
  "\\def": 603,
  "\\arraystretch": 604,
  "\\And": 605,
  "\\surd": 606,
  "\\unlhd": 607,
  "\\nulldelimiterspace": 608,
  "\\dashv": 609,
  "\\varPi": 610,
  "\\footnote": 611,
  "\\bigcirc": 612,
  "\\curlyvee": 613,
  "\\mathclap": 614,
  "\\heartsuit": 615,
  "\\lozenge": 616,
  "\\^": 617,
  "\\hfill": 618,
  "\\eqqcolon": 619,
  "\\thicksim": 620,
  "\\mathrlap": 621,
  "\\Uparrow": 622,
  "\\sphericalangle": 623,
  "\\gets": 624,
  "\\nsubseteq": 625,
  "\\Vdash": 626,
  "\\root": 627,
  "\\of": 628,
  "\\Subset": 629,
  "\\medspace": 630,
  "\\varliminf": 631,
  "\\relax": 632,
  "\\vrule": 633,
  "\\because": 634,
  "\\succcurlyeq": 635,
  "\\mho": 636,
  "\\Vec": 637,
  "\\pitchfork": 638,
  "\\unrhd": 639,
  "\\mathopen": 640,
  "\\mathclose": 641,
  "\\abovedisplayskip": 642,
  "\\belowdisplayskip": 643,
  "\\right/": 644,
  "\\circledS": 645,
  "\\eqsim": 646,
  "\\xRightarrow": 647,
  "\\uproot": 648,
  "\\hskip": 649,
  "\\circlearrowright": 650,
  "\\space": 651,
  "\\subsetneqq": 652,
  "\\vDash": 653,
  "\\varSigma": 654,
  "\\leftroot": 655,
  "\\Downarrow": 656,
  "\\circledcirc": 657
}